01Hub/fbedit/BoatNavBluetooth/STM32_Sonar/main.c
/*******************************************************************************
* File Name          : main.c
* Author             : KetilO
* Version            : V1.1.0
* Date               : 03/15/2012
* Description        : Main program body
********************************************************************************

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x_lib.h"

/* Private define ------------------------------------------------------------*/
// Uncomment the clock speed you will be using
//#define STM32Clock24MHz
//#define STM32Clock28MHz
//#define STM32Clock32MHz
#define STM32Clock40MHz
//#define STM32Clock48MHz
//#define STM32Clock56MHz

#define MAXECHO           ((u16)512)
#define MAXGPS            ((u16)512)
#define MAXBLUETOOTH      ((u16)512)
#define ADC1_ICDR_Address ((u32)0x4001243C)

typedef struct
{
  vu8 Start;                                    // 0x20000000 0=Wait/Done, 1=Start, 2=In progress
  u8 PingPulses;                                // 0x20000001 Number of ping pulses (0-255)
  u8 PingTimer;                                 // 0x20000002 TIM1 auto reload value, ping frequency
  u8 RangeInx;                                  // 0x20000003 Current range index
  u16 PixelTimer;                               // 0x20000004 TIM2 auto reload value, sample rate
  vu16 EchoIndex;                               // 0x20000006 Current index into EchoArray
  u16 ADCBatt;                                  // 0x20000008 Battery
  u16 ADCWaterTemp;                             // 0x2000000A Water temprature
  u16 ADCAirTemp;                               // 0x2000000C Air temprature
  vu16 GPSHead;                                 // 0x2000000E GPSArray head, index into GPSArray
  u8 EchoArray[MAXECHO];                        // 0x20000010 Echo array
  u16 GainArray[MAXECHO];                       // 0x20000210 Gain array
  u16 GainInit[18];                             // 0x20000610 Gain setup array, first half word is initial gain
  u8 GPSArray[MAXGPS];                          // 0x20000634 GPS array, received GPS NMEA 0183 messages
  vu16 BLUETOOTHHead;                           // 0x20000834 BLUETOOTHArray head, index into BLUETOOTHArray
  u8 BLUETOOTHArray[MAXBLUETOOTH];              // 0x20000836 Bluetooth array, received bluetooth messages
}STM32_SonarTypeDef;

typedef struct
{
	u8 SatelliteID;								                // Satelite ID
	u8 Elevation;								                  // Elevation in degrees (0-90)
	u16 Azimuth;								                  // Azimuth in degrees (0-359)
	u8 SNR;									                      // Signal strenght	(0-50, 0 not tracked) 
	u8 Fixed;									                    // TRUE if used in fix
} STM32_SateliteTypeDef;

typedef struct
{
	u8 fixquality;                                // Fix quality
	u8 nsat;                                      // Number of satelites tracked
	u16 hdop;									                    // Horizontal dilution of position * 10
	u16 vdop;									                    // Vertical dilution of position * 10
	u16 pdop;									                    // Position dilution of position * 10
	u16 alt;									                    // Altitude in meters
} STM32_AltitudeTypeDef;

typedef struct
{
  u16 Lenght;                                   // 
  u16 Chksum;                                   // 
  u8 Version;                                   // 201
  u8 PingPulses;                                // Number of pulses in a ping (0 to 128)
  u16 GainSet;                                  // Gain set level (0 to 4095)
  u16 SoundSpeed;                               // Speed of sound in water
  u16 ADCBattery;                               // Battery level
  u16 ADCWaterTemp;                             // Water temprature
  u16 ADCAirTemp;                               // Air temprature
  u32 iTime;                                    // UTC Dos file time. 2 seconds resolution
  u32 iLon;                                     // Longitude, integer
  u32 iLat;                                     // Lattitude, integer
  u16 iSpeed;                                   // Speed in kts
  u16 iBear;                                    // Bearing in degrees
  STM32_SateliteTypeDef Satelite[12];           // 12 Satelites
  STM32_AltitudeTypeDef Altitude;               // Alttude + more
  u8 EchoArray[MAXECHO];                        // Echo array
} STM32_SonarDataTypeDef;

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
static STM32_SonarTypeDef STM32_Sonar;          // 0x20000000
static STM32_SonarDataTypeDef STM32_SonarData;
vu8 BlueLED;                                    // Current state of the blue led
vu16 Ping;                                      // Value to output to PA1 and PA2 pins
vu8 Setup;                                      // Setup mode
const u8 GPSBaud[]="$PSRF100,1,9600,8,1,0*0D\r\n\0";  // Set baudrate to 9600
const u8 GPSInit[]="$PSRF103,04,00,01,00*20\r\n$PSRF103,03,00,05,00*23\r\n$PSRF103,00,00,05,00*20\r\n$PSRF103,02,00,05,00*22\r\n$PSRF103,01,00,00,00*24\r\n$PSRF103,05,00,00,00*20\r\n\0";

/* Private function prototypes -----------------------------------------------*/
void RCC_Configuration(void);
void GPIO_Configuration(void);
void NVIC_Configuration(void);
void ADC_Startup(void);
void ADC_Configuration(void);
void TIM1_Configuration(void);
void TIM2_Configuration(void);
void TIM3_Configuration(void);
void USART1_Configuration(u16 Baud);
void USART3_Configuration(u16 Baud);
u16 GetADCValue(u8 Channel);
void USART1_puts(char *str);
void USART3_putdata(char *data,u16 lenght);
void GainSetup(void);
void TrimOutput(void);
void GetEcho(void);

/* Private functions ---------------------------------------------------------*/

/*******************************************************************************
* Function Name  : main
* Description    : Main program
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
int main(void)
{
  u32 i;
  STM32_SonarData.Lenght = sizeof STM32_SonarData;
  STM32_SonarData.Version = 201;
  /* System clocks configuration */
  RCC_Configuration();
  /* NVIC configuration */
  NVIC_Configuration();
  /* GPIO configuration */
  GPIO_Configuration();
  /* TIM1 configuration */
  TIM1_Configuration();
  /* TIM3 configuration */
  TIM3_Configuration();
  /* ADC1 configuration */
  ADC_Startup();
  /* ADC1 injected channel configuration */
  ADC_Configuration();
  /* Enable DAC channel1 and channel2, buffered output */
  DAC->CR = 0x10001;
  /* Set the DAC channel1 to output lowest gain */
  DAC->DHR12R1 = (u16)0x0;
  /* Set the DAC channel2 to output middle output trim */
  DAC->DHR12R2 = (u16)0x400;
  /* Setup USART1 4800 baud */
  USART1_Configuration(4800);
  /* Setup USART3 9600 baud */
  USART3_Configuration(9600);
  /* Wait until GPS module has started up */
  i = 0;
  while (i++ < 20000000)
  {
  }
  USART1_puts((char*) GPSBaud);
  i = 0;
  while (i++ < 20000000)
  {
  }
  /* Set USART1 baudrate to 9600 */
  USART1_Configuration(9600);
  i = 0;
  while (i++ < 20000000)
  {
  }
  USART1_puts((char*) GPSInit);

  Setup = 0;
  if (GPIO_ReadInputDataBit(GPIOA,GPIO_Pin_0))
  {
    /* Enable TIM3 */
    TIM_Cmd(TIM3, ENABLE);
    Setup = 1;
  }
  while (1)
  {
    if (STM32_Sonar.Start == 1)
    {
      STM32_Sonar.Start = 99;
      /* Toggle blue led */
      if (BlueLED)
      {
        GPIO_WriteBit(GPIOC, GPIO_Pin_8, Bit_RESET);
        BlueLED = 0;
      }
      else
      {
        GPIO_WriteBit(GPIOC, GPIO_Pin_8, Bit_SET);
        BlueLED = 1;
      }
      /* Setup gain array */
      GainSetup();
      /* Clear the echo array */
      i = 1;
      while (i < MAXECHO)
      {
        STM32_Sonar.EchoArray[i] = 0;
        STM32_SonarData.EchoArray[i] = 0;
        i++;
      }
      /* Read battery */
      STM32_Sonar.ADCBatt = GetADCValue(ADC_Channel_14);
      STM32_SonarData.ADCBattery = STM32_Sonar.ADCBatt;
      /* Read water temprature */
      STM32_Sonar.ADCWaterTemp = GetADCValue(ADC_Channel_6);
      STM32_SonarData.ADCWaterTemp = STM32_Sonar.ADCWaterTemp;
      /* Read air temprature */
      STM32_Sonar.ADCAirTemp = GetADCValue(ADC_Channel_7);
      STM32_SonarData.ADCAirTemp = STM32_Sonar.ADCAirTemp;
      if (Setup)
      {
        /* No ping in setup mode */
        STM32_Sonar.PingPulses = 0;
      }
      else
      {
        TrimOutput();
      }
      /* Enable ADC injected channel */
      ADC_AutoInjectedConvCmd(ADC1, ENABLE);
      /* Set the TIM1 Autoreload value */
      TIM1->ARR = STM32_Sonar.PingTimer;
      /* Set the TIM3 Autoreload value */
      TIM3->ARR = STM32_Sonar.PingTimer*2+1;
      /* Reset TIM1 count */
      TIM1->CNT = 0;
      /* Set TIM1 repetirion counter */
      TIM1->RCR = 0;
      /* Reset echo index */
      STM32_Sonar.EchoIndex = 0;
      /* Init Ping */
      Ping = 0x2;
      /* Disable the USART1 Receive interrupt: this interrupt is generated when the 
         USART1 receive data register is not empty */
      USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);
      /* Enable TIM1 */
      TIM_Cmd(TIM1, ENABLE);
      /* Get the Echo array */
      GetEcho();
      /* Store the current range as the first byte in the echo array */
      STM32_Sonar.EchoArray[0] = STM32_Sonar.RangeInx;
      STM32_SonarData.EchoArray[0] = STM32_Sonar.RangeInx;
      /* Done, Disable TIM2 */
      TIM2->CR1 = 0;
      /* Disable ADC injected channel */
      ADC_AutoInjectedConvCmd(ADC1, DISABLE);
      /* Set the DAC to output lowest gain */
      DAC->DHR12R1 = (u16)0x0;
    }
    else if (STM32_Sonar.Start == 2)
    {
      /* Send initialization data to GPS */
      // USART1_puts((char*) (u32 *)STM32_Sonar.GainArray);
      STM32_Sonar.Start=0;
    }
    else if (STM32_Sonar.Start == 3)
    {
      /* Set USART1 baudrate to 9600 */
      // USART1_Configuration(9600);
      STM32_Sonar.Start=0;
    }
    else if (STM32_Sonar.Start == 4)
    {
      /* Read battery */
      STM32_Sonar.ADCBatt = GetADCValue(ADC_Channel_14);
      /* Read water temprature */
      STM32_Sonar.ADCWaterTemp = GetADCValue(ADC_Channel_6);
      /* Read air temprature */
      STM32_Sonar.ADCAirTemp = GetADCValue(ADC_Channel_7);
      STM32_Sonar.Start=0;
    }
    i = 1000;
    while (i--);
  }
}

