01Hub/fbedit/BoatNavBluetooth/STM32_Sonar/main.c
void TrimOutput(void)
{
  u16 Trim;
  u16 TrimAdd;
  vu32 i;

  /* Trim echo output to near zero */
  Trim = (u16)0x400;
  TrimAdd = (u16)0x200;
  while (TrimAdd)
  {
    DAC->DHR12R2 = Trim;
    i = 10000;
    while (i--);
    if (GetADCValue(ADC_Channel_3)>32)
    {
      Trim = Trim + TrimAdd;
    }
    else
    {
      Trim = Trim - TrimAdd;
    }
    TrimAdd = TrimAdd / 2;
  }
}

void GetEcho(void)
{
  u32* ADC;
  u8 Echo;

  /* Get pointer to injected channel */
  ADC = ( (u32 *) ADC1_ICDR_Address);
  while (STM32_Sonar.Start)
  {
    /* To eliminate the need for an advanced AM demodulator the largest */ 
    /* ADC reading is stored in its echo array element */
    /* Get echo */
    Echo = ( (*(u32*) (((*(u32*)&ADC)))) >> 4);
    /* If echo larger than previous echo then update the echo array */
    if (Echo > STM32_Sonar.EchoArray[STM32_Sonar.EchoIndex])
    {
      STM32_Sonar.EchoArray[STM32_Sonar.EchoIndex] = Echo;
      STM32_SonarData.EchoArray[STM32_Sonar.EchoIndex] = Echo;
    }
  }
}

/*******************************************************************************
* Function Name  : GetADCValue
* Description    : This function sums 16 ADC conversions and returns the average.
* Input          : ADC channel
* Output         : None
* Return         : The ADC cannel reading
*******************************************************************************/
u16 GetADCValue(u8 Channel)
{
  vu8 i;
  vu16 ADCValue;
  ADC_InitTypeDef ADC_InitStructure;

  ADCValue = 0;
  ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
  ADC_InitStructure.ADC_ScanConvMode = ENABLE;
  ADC_InitStructure.ADC_ContinuousConvMode = ENABLE;
  ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
  ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
  ADC_InitStructure.ADC_NbrOfChannel = 1;
  ADC_Init(ADC1, &ADC_InitStructure);
  /* ADC1 regular channel configuration */ 
  ADC_RegularChannelConfig(ADC1, Channel, 1, ADC_SampleTime_239Cycles5);
  /* Start ADC1 Software Conversion */ 
  ADC_SoftwareStartConvCmd(ADC1, ENABLE);
  /* Add 16 conversions to reduce thermal noise */
  i = 16;
  while (i--)
  {
    ADC_ClearFlag(ADC1, ADC_FLAG_EOC);
    while (ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC) == RESET)
    {
    }
    ADCValue += ADC1->DR;
  }
  /* Stop ADC1 Software Conversion */ 
  ADC_SoftwareStartConvCmd(ADC1, DISABLE);
  /* Return average of the 16 added conversions */
  return (ADCValue >> 4);
}

/*******************************************************************************
* Function Name  : GainSetup
* Description    : This function sets up the gain levels for each pixel
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void GainSetup(void)
{
  vu32 GainInitInx;
  vu32 i;
  vu32 GainInx;
  vu32 GainInc;
  vu32 GainVal;
  GainInitInx=1;
  GainInx=0;
  while (GainInitInx<17)
  {
    GainVal=STM32_Sonar.GainInit[GainInitInx]<<13;
    GainInc=(STM32_Sonar.GainInit[GainInitInx+1]-STM32_Sonar.GainInit[GainInitInx])<<8;
    i=0;
    while (i<32)
    {
      STM32_Sonar.GainArray[GainInx]=(GainVal>>13)+STM32_Sonar.GainInit[0];
      if ((GainVal>>12) && 1)
      {
        STM32_Sonar.GainArray[GainInx]++;
      }
      if (STM32_Sonar.GainArray[GainInx]>4095)
      {
        STM32_Sonar.GainArray[GainInx]=4095;
      }
      GainVal+=GainInc;
      GainInx++;
      i++;
    }
    GainInitInx++;
  }
}

/*******************************************************************************
* Function Name  : TIM1_UP_IRQHandler
* Description    : This function handles TIM1 global interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_UP_IRQHandler(void)
{
  /* Set ping outputs high (FET's off) */
  GPIOA->BSRR = (u16) (GPIO_Pin_2 | GPIO_Pin_1);
  if (STM32_Sonar.PingPulses)
  {
    GPIOA->ODR = Ping;
    if (Ping == 0x2)
    {
      Ping = 0x4;     // PA02
    }
    else
    {
      Ping = 0x2;     // PA01
      STM32_Sonar.PingPulses--;
    }
  }
  else
  {
    /* Ping done, Disable TIM1 */
    TIM_Cmd(TIM1, DISABLE);
    /* TIM2 configuration */
    TIM2_Configuration();
    /* Clear TIM2 Update interrupt pending bit */
    TIM2->SR = (u16)~TIM_IT_Update;
    /* Enable TIM2 */
    TIM_Cmd(TIM2, ENABLE);
    /* Enable the USART1 Receive interrupt: this interrupt is generated when the 
       USART1 receive data register is not empty */
    USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
  }
  /* Clear TIM1 Update interrupt pending bit */
  TIM1->SR = (u16)~TIM_IT_Update;
}

/*******************************************************************************
* Function Name  : TIM2_IRQHandler
* Description    : This function handles TIM2 global interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void TIM2_IRQHandler(void)
{
  /* Clear TIM2 Update interrupt pending bit */
  asm("mov    r0,#0x40000000");               /* TIM2 */
  asm("strh   r0,[r0,#0x8 *2]");              /* TIM2->SR */

  /* Increment the echo array index */
  asm("mov    r1,#0x20000000");               /* STM32_Sonar */
  asm("ldrh   r2,[r1,#0x6]");                 /* STM32_Sonar.EchoIndex */
  asm("add    r2,r2,#0x1");
  asm("cmp    r2,#0x200");
  asm("ite    ne");
  asm("strhne r2,[r1,#0x6]");                 /* Update STM32_Sonar.EchoIndex */
  asm("strbeq r2,[r1,#0x0]");                 /* Reset STM32_Sonar.Start */

  /* Update the DAC to output next gain level */
  asm("movw   r0,#0x7400");                   /* DAC1 */
  asm("movt   r0,#0x4000");
  asm("add    r2,r2,0x108");
  asm("ldrh   r3,[r1,r2,lsl #0x1]");
  asm("strh   r3,[r0,#0x8]");                 /* DAC_DHR12R1 */
}

