01Hub/fbedit/BoatNavBluetooth/STM32_Sonar/main.c
/*******************************************************************************
* Function Name  : USART1_puts
* Description    : This function transmits a zero terminated string
* Input          : Zero terminated string
* Output         : None
* Return         : None
*******************************************************************************/
void USART1_puts(char *str)
{
  char c;
  /* Characters are transmitted one at a time. */
  while ((c = *str++))
  {
    /* Wait until transmit register empty */
    while((USART1->SR & USART_FLAG_TXE) == 0);          
    /* Transmit Data */
    USART1->DR = (u16)c;
  }
}

/*******************************************************************************
* Function Name  : USART3_putdata
* Description    : This function transmits data
* Input          : data, lenght
* Output         : None
* Return         : None
*******************************************************************************/
void USART3_putdata(char *data,u16 lenght)
{
  char c;
  /* Characters are transmitted one at a time. */
  while (lenght--)
  {
    /* Wait until transmit register empty */
    while((USART3->SR & USART_FLAG_TXE) == 0);          
    /* Transmit Data */
    USART3->DR = (u16)c;
    *data++;
  }
}

/*******************************************************************************
* Function Name  : USART1_IRQHandler
* Description    : This function handles USART1 global interrupt request.
*                  An interrupt is generated when a character is recieved.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void USART1_IRQHandler(void)
{
  /* Get pointer to USART1->DR */
  asm("movw   r0,#0x3800");
  asm("movt   r0,#0x4001");
  /* Get recieved halfword */
  asm("ldrh   r3,[r0,#0x2*2]");
  /* Get pointer to STM32_Sonar */
  asm("mov    r0,#0x20000000");
  /* Get GPSHead value */
  asm("ldrh   r2,[r0,#0x7*2]");
  /* Get offset to GPSArray */
  asm("movw   r1,#0x634");
  /* Get pointer to GPSArray */
  asm("add    r1,r1,r0");
  /* Store received byte at GPSArray[GPSHead] */
  asm("strb   r3,[r1,r2]");
  /* Increment GPSHead */
  asm("add    r2,r2,#0x1");
  /* Limit GPSHead to 512 bytes*/
  asm("mov    r2,r2,lsl #23");
  asm("mov    r2,r2,lsr #23");
  /* Store GPSHead */
  asm("strh   r2,[r0,#0x7*2]");

  // STM32_Sonar.GPSArray[STM32_Sonar.GPSHead++]=USART1->DR;
  // /* Limit GPSHead to 512 bytes array*/
  // STM32_Sonar.GPSHead&=MAXGPS-1;
}

/*******************************************************************************
* Function Name  : USART3_IRQHandler
* Description    : This function handles USART3 global interrupt request.
*                  An interrupt is generated when a character is recieved.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void USART3_IRQHandler(void)
{
  /* Get pointer to USART3->DR */
  asm("movw   r0,#0x4800");
  asm("movt   r0,#0x4000");
  /* Get recieved halfword */
  asm("ldrh   r3,[r0,#0x2*2]");
  /* Get pointer to STM32_Sonar */
  asm("mov    r0,#0x20000000");
  /* Get BLUETOOTHHead value */
  asm("ldrh   r2,[r0,#0x834]");
  /* Get offset to BLUETOOTHArray */
  asm("movw   r1,#0x836");
  /* Get pointer to BLUETOOTHArray */
  asm("add    r1,r1,r0");
  /* Store received byte at GPSArray[GPSHead] */
  asm("strb   r3,[r1,r2]");
  /* Increment BLUETOOTHHead */
  asm("add    r2,r2,#0x1");
  /* Limit BLUETOOTHHead to 512 bytes*/
  asm("mov    r2,r2,lsl #23");
  asm("mov    r2,r2,lsr #23");
  /* Store BLUETOOTHHead */
  asm("strh   r2,[r0,#0x834]");

  // STM32_Sonar.BLUETOOTHArray[STM32_Sonar.BLUETOOTHHead++]=USART3->DR;
  // /* Limit BLUETOOTHHead to 512 bytes array*/
  // STM32_Sonar.BLUETOOTHHead&=MAXBLUETOOTH-1;
}

/*******************************************************************************
* Function Name  : ADC_Startup
* Description    : This function calibrates ADC1.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void ADC_Startup(void)
{
  ADC_InitTypeDef ADC_InitStructure;
  /* ADCCLK = PCLK2/2 */
  RCC_ADCCLKConfig(RCC_PCLK2_Div2);
  /* ADC1 configuration ------------------------------------------------------*/
  ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
  ADC_InitStructure.ADC_ScanConvMode = ENABLE;
  ADC_InitStructure.ADC_ContinuousConvMode = ENABLE;
  ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
  ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
  ADC_InitStructure.ADC_NbrOfChannel = 1;
  ADC_Init(ADC1, &ADC_InitStructure);
  /* ADC1 regular channel2 configuration */ 
  ADC_RegularChannelConfig(ADC1, ADC_Channel_3, 1, ADC_SampleTime_55Cycles5);
  /* Enable ADC1 */
  ADC_Cmd(ADC1, ENABLE);
  /* Enable ADC1 reset calibaration register */   
  ADC_ResetCalibration(ADC1);
  /* Check the end of ADC1 reset calibration register */
  while(ADC_GetResetCalibrationStatus(ADC1));
  /* Start ADC1 calibaration */
  ADC_StartCalibration(ADC1);
  /* Check the end of ADC1 calibration */
  while(ADC_GetCalibrationStatus(ADC1));
}

/*******************************************************************************
* Function Name  : ADC_Configuration
* Description    : This function prepares ADC1 for Injected conversion
*                  on channel 2.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void ADC_Configuration(void)
{
  ADC_InitTypeDef ADC_InitStructure;

  /* ADCCLK = PCLK2/2 */
  RCC_ADCCLKConfig(RCC_PCLK2_Div2);
  ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
  ADC_InitStructure.ADC_ScanConvMode = ENABLE;
  ADC_InitStructure.ADC_ContinuousConvMode = ENABLE;
  ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
  ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
  /* ADC1 single channel configuration */
  ADC_InitStructure.ADC_NbrOfChannel = 1;
  ADC_Init(ADC1, &ADC_InitStructure);
  /* Setup injected channel */
  ADC_InjectedSequencerLengthConfig(ADC1,1);
  /* Sonar echo */
  ADC_InjectedChannelConfig(ADC1,ADC_Channel_3,1,ADC_SampleTime_1Cycles5);
}

